In [1]:
import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
%matplotlib inline

In [2]:
df=pd.read_csv('https://raw.githubusercontent.com/ogrisel/parallel_ml_tutorial/master/notebooks/titanic_train.csv',sep=",")
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [3]:
df.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [4]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [5]:
df[['Name','Sex','Ticket','Cabin','Embarked']].

,Name,Sex,Ticket,Cabin,Embarked
0,"Braund, Mr. Owen Harris",male,A/5 21171,NaN,S
1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,PC 17599,C85,C
2,"Heikkinen, Miss. Laina",female,STON/O2. 3101282,NaN,S
3,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,113803,C123,S
4,"Allen, Mr. William Henry",male,373450,NaN,S
...,...,...,...,...,...
886,"Montvila, Rev. Juozas",male,211536,NaN,S
887,"Graham, Miss. Margaret Edith",female,112053,B42,S
888,"Johnston, Miss. Catherine Helen ""Carrie""",female,W./C. 6607,NaN,S
889,"Behr, Mr. Karl Howell",male,111369,C148,C
890,"Dooley, Mr. Patrick",male,370376,NaN,Q

In [7]:
a=df.dtypes[df.dtypes==object].index
a
df[a].describe()

                           Name   Sex  Ticket    Cabin Embarked
count                       891   891     891      204      889
unique                      891     2     681      147        3
top     Braund, Mr. Owen Harris  male  347082  B96 B98        S
freq                          1   577       7        4      644

Name        object
Sex         object
Ticket      object
Cabin       object
Embarked    object
dtype: object

In [11]:
b=df.dtypes[df.dtypes=='int64'].index
df[b].describe()

       PassengerId    Survived      Pclass       SibSp       Parch
count   891.000000  891.000000  891.000000  891.000000  891.000000
mean    446.000000    0.383838    2.308642    0.523008    0.381594
std     257.353842    0.486592    0.836071    1.102743    0.806057
min       1.000000    0.000000    1.000000    0.000000    0.000000
25%     223.500000    0.000000    2.000000    0.000000    0.000000
50%     446.000000    0.000000    3.000000    0.000000    0.000000
75%     668.500000    1.000000    3.000000    1.000000    0.000000
max     891.000000    1.000000    3.000000    8.000000    6.000000

In [14]:
sorted(df['Name'])[5:10:2]

['Adahl, Mr. Mauritz Nils Martin',
 'Ahlin, Mrs. Johan (Johanna Persdotter Larsson)',
 'Albimona, Mr. Nassef Cassem']

In [15]:
df[["Name"]][::2]

                                                  Name
0                              Braund, Mr. Owen Harris
2                               Heikkinen, Miss. Laina
4                             Allen, Mr. William Henry
6                              McCarthy, Mr. Timothy J
8    Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)
..                                                 ...
882                       Dahlberg, Miss. Gerda Ulrika
884                             Sutehall, Mr. Henry Jr
886                              Montvila, Rev. Juozas
888           Johnston, Miss. Catherine Helen "Carrie"
890                                Dooley, Mr. Patrick

[446 rows x 1 columns]

In [25]:
b=[sorted(df['Name'])[::]]

In [27]:
print(b)

[['Abbing, Mr. Anthony', 'Abbott, Mr. Rossmore Edward', 'Abbott, Mrs. Stanton (Rosa Hunt)', 'Abelson, Mr. Samuel', 'Abelson, Mrs. Samuel (Hannah Wizosky)', 'Adahl, Mr. Mauritz Nils Martin', 'Adams, Mr. John', 'Ahlin, Mrs. Johan (Johanna Persdotter Larsson)', 'Aks, Mrs. Sam (Leah Rosen)', 'Albimona, Mr. Nassef Cassem', 'Alexander, Mr. William', 'Alhomaki, Mr. Ilmari Rudolf', 'Ali, Mr. Ahmed', 'Ali, Mr. William', 'Allen, Miss. Elisabeth Walton', 'Allen, Mr. William Henry', 'Allison, Master. Hudson Trevor', 'Allison, Miss. Helen Loraine', 'Allison, Mrs. Hudson J C (Bessie Waldo Daniels)', 'Allum, Mr. Owen George', 'Andersen-Jensen, Miss. Carla Christine Nielsine', 'Anderson, Mr. Harry', 'Andersson, Master. Sigvard Harald Elias', 'Andersson, Miss. Ebba Iris Alfrida', 'Andersson, Miss. Ellis Anna Maria', 'Andersson, Miss. Erna Alexandra', 'Andersson, Miss. Ingeborg Constanzia', 'Andersson, Miss. Sigrid Elisabeth', 'Andersson, Mr. Anders Johan', 'Andersson, Mr. August Edvard ("Wennerstrom")', 'Andersson, Mrs. Anders Johan (Alfrida Konstantia Brogren)', 'Andreasson, Mr. Paul Edvin', 'Andrew, Mr. Edgardo Samuel', 'Andrews, Miss. Kornelia Theodosia', 'Andrews, Mr. Thomas Jr', 'Angle, Mrs. William A (Florence "Mary" Agnes Hughes)', 'Appleton, Mrs. Edward Dale (Charlotte Lamson)', 'Arnold-Franchi, Mr. Josef', 'Arnold-Franchi, Mrs. Josef (Josefine Franchi)', 'Artagaveytia, Mr. Ramon', 'Asim, Mr. Adola', 'Asplund, Master. Clarence Gustaf Hugo', 'Asplund, Master. Edvin Rojj Felix', 'Asplund, Miss. Lillian Gertrud', 'Asplund, Mrs. Carl Oscar (Selma Augusta Emilia Johansson)', 'Astor, Mrs. John Jacob (Madeleine Talmadge Force)', 'Attalah, Miss. Malake', 'Attalah, Mr. Sleiman', 'Aubart, Mme. Leontine Pauline', 'Augustsson, Mr. Albert', 'Ayoub, Miss. Banoura', 'Backstrom, Mr. Karl Alfred', 'Backstrom, Mrs. Karl Alfred (Maria Mathilda Gustafsson)', 'Baclini, Miss. Eugenie', 'Baclini, Miss. Helene Barbara', 'Baclini, Miss. Marie Catherine', 'Baclini, Mrs. Solomon (Latifa Qurban)', 'Badt, Mr. Mohamed', 'Bailey, Mr. Percy Andrew', 'Balkic, Mr. Cerin', 'Ball, Mrs. (Ada E Hall)', 'Banfield, Mr. Frederick James', 'Barah, Mr. Hanna Assi', 'Barbara, Miss. Saiide', 'Barbara, Mrs. (Catherine David)', 'Barber, Miss. Ellen "Nellie"', 'Barkworth, Mr. Algernon Henry Wilson', 'Barton, Mr. David John', 'Bateman, Rev. Robert James', 'Baumann, Mr. John D', 'Baxter, Mr. Quigg Edmond', 'Baxter, Mrs. James (Helene DeLaudeniere Chaput)', 'Bazzani, Miss. Albina', 'Beane, Mr. Edward', 'Beane, Mrs. Edward (Ethel Clarke)', 'Beavan, Mr. William Thomas', 'Becker, Master. Richard F', 'Becker, Miss. Marion Louise', 'Beckwith, Mr. Richard Leonard', 'Beckwith, Mrs. Richard Leonard (Sallie Monypeny)', 'Beesley, Mr. Lawrence', 'Behr, Mr. Karl Howell', 'Bengtsson, Mr. John Viktor', 'Berglund, Mr. Karl Ivar Sven', 'Berriman, Mr. William John', 'Betros, Mr. Tannous', 'Bidois, Miss. Rosalie', 'Bing, Mr. Lee', 'Birkeland, Mr. Hans Martin Monsen', 'Bishop, Mr. Dickinson H', 'Bishop, Mrs. Dickinson H (Helen Walton)', 'Bissette, Miss. Amelia', 'Bjornstrom-Steffansson, Mr. Mauritz Hakan', 'Blackwell, Mr. Stephen Weart', 'Blank, Mr. Henry', 'Bonnell, Miss. Elizabeth', 'Bostandyeff, Mr. Guentcho', 'Boulos, Miss. Nourelain', 'Boulos, Mr. Hanna', 'Boulos, Mrs. Joseph (Sultana)', 'Bourke, Miss. Mary', 'Bourke, Mr. John', 'Bourke, Mrs. John (Catherine)', 'Bowen, Mr. David John "Dai"', 'Bowerman, Miss. Elsie Edith', 'Bracken, Mr. James H', 'Bradley, Mr. George ("George Arthur Brayton")', 'Braund, Mr. Lewis Richard', 'Braund, Mr. Owen Harris', 'Brewe, Dr. Arthur Jackson', 'Brocklebank, Mr. William Alfred', 'Brown, Miss. Amelia "Mildred"', 'Brown, Mr. Thomas William Solomon', 'Brown, Mrs. James Joseph (Margaret Tobin)', 'Brown, Mrs. Thomas William Solomon (Elizabeth Catherine Ford)', 'Bryhl, Mr. Kurt Arnold Gottfrid', 'Burke, Mr. Jeremiah', 'Burns, Miss. Elizabeth Margaret', 'Buss, Miss. Kate', 'Butler, Mr. Reginald Fenton', 'Butt, Major. Archibald Willingham', 'Byles, Rev. Thomas Roussel Davids', 'Bystrom, Mrs. (Karolina)', 'Cacic, Miss. Marija', 'Cacic, Mr. Luka', 'Cairns, Mr. Alexander', 'Calderhead, Mr. Edward Pennington', 'Caldwell, Master. Alden Gates', 'Caldwell, Mrs. Albert Francis (Sylvia Mae Harbaugh)', 'Calic, Mr. Jovo', 'Calic, Mr. Petar', 'Cameron, Miss. Clear Annie', 'Campbell, Mr. William', 'Canavan, Miss. Mary', 'Cann, Mr. Ernest Charles', 'Caram, Mrs. Joseph (Maria Elias)', 'Carbines, Mr. William', 'Cardeza, Mr. Thomas Drake Martinez', 'Carlsson, Mr. August Sigfrid', 'Carlsson, Mr. Frans Olof', 'Carr, Miss. Helen "Ellen"', 'Carrau, Mr. Francisco M', 'Carter, Master. William Thornton II', 'Carter, Miss. Lucile Polk', 'Carter, Mr. William Ernest', 'Carter, Mrs. Ernest Courtenay (Lilian Hughes)', 'Carter, Mrs. William Ernest (Lucile Polk)', 'Carter, Rev. Ernest Courtenay', 'Cavendish, Mr. Tyrell William', 'Celotti, Mr. Francesco', 'Chaffee, Mr. Herbert Fuller', 'Chambers, Mr. Norman Campbell', 'Chambers, Mrs. Norman Campbell (Bertha Griggs)', 'Chapman, Mr. Charles Henry', 'Chapman, Mr. John Henry', 'Charters, Mr. David', 'Cherry, Miss. Gladys', 'Chibnall, Mrs. (Edith Martha Bowerman)', 'Chip, Mr. Chang', 'Christmann, Mr. Emil', 'Christy, Miss. Julie Rachel', 'Chronopoulos, Mr. Apostolos', 'Clarke, Mrs. Charles V (Ada Maria Winfield)', 'Cleaver, Miss. Alice', 'Clifford, Mr. George Quincy', 'Coelho, Mr. Domingos Fernandeo', 'Cohen, Mr. Gurshon "Gus"', 'Coleff, Mr. Peju', 'Coleff, Mr. Satio', 'Coleridge, Mr. Reginald Charles', 'Collander, Mr. Erik Gustaf', 'Colley, Mr. Edward Pomeroy', 'Collyer, Miss. Marjorie "Lottie"', 'Collyer, Mr. Harvey', 'Collyer, Mrs. Harvey (Charlotte Annie Tate)', 'Compton, Miss. Sara Rebecca', 'Connaghton, Mr. Michael', 'Connolly, Miss. Kate', 'Connors, Mr. Patrick', 'Cook, Mr. Jacob', 'Cor, Mr. Liudevit', 'Corn, Mr. Harry', 'Coutts, Master. Eden Leslie "Neville"', 'Coutts, Master. William Loch "William"', 'Coxon, Mr. Daniel', 'Crease, Mr. Ernest James', 'Cribb, Mr. John Hatfield', 'Crosby, Capt. Edward Gifford', 'Crosby, Miss. Harriet R', 'Culumovic, Mr. Jeso', 'Cumings, Mrs. John Bradley (Florence Briggs Thayer)', 'Cunningham, Mr. Alfred Fleming', 'Dahl, Mr. Karl Edwart', 'Dahlberg, Miss. Gerda Ulrika', 'Dakic, Mr. Branko', 'Daly, Mr. Eugene Patrick', 'Daly, Mr. Peter Denis ', 'Danbom, Mr. Ernst Gilbert', 'Danbom, Mrs. Ernst Gilbert (Anna Sigrid Maria Brogren)', 'Daniel, Mr. Robert Williams', 'Danoff, Mr. Yoto', 'Dantcheff, Mr. Ristiu', 'Davidson, Mr. Thornton', 'Davies, Master. John Morgan Jr', 'Davies, Mr. Alfred J', 'Davies, Mr. Charles Henry', 'Davis, Miss. Mary', 'Davison, Mrs. Thomas Henry (Mary E Finck)', 'Dean, Master. Bertram Vere', 'Dean, Mr. Bertram Frank', 'Denkoff, Mr. Mitto', 'Dennis, Mr. Samuel', 'Devaney, Miss. Margaret Delia', 'Dick, Mr. Albert Adrian', 'Dick, Mrs. Albert Adrian (Vera Gillespie)', 'Dimic, Mr. Jovan', 'Dodge, Master. Washington', 'Doharr, Mr. Tannous', 'Doling, Miss. Elsie', 'Doling, Mrs. John T (Ada Julia Bone)', 'Dooley, Mr. Patrick', 'Dorking, Mr. Edward Arthur', 'Douglas, Mr. Walter Donald', 'Dowdell, Miss. Elizabeth', 'Downton, Mr. William James', 'Drazenoic, Mr. Jozef', 'Drew, Mrs. James Vivian (Lulu Thorne Christian)', 'Duane, Mr. Frank', 'Duff Gordon, Lady. (Lucille Christiana Sutherland) ("Mrs Morgan")', 'Duff Gordon, Sir. Cosmo Edmund ("Mr Morgan")', 'Duran y More, Miss. Asuncion', 'Edvardsson, Mr. Gustaf Hjalmar', 'Eitemiller, Mr. George Floyd', 'Eklund, Mr. Hans Linus', 'Ekstrom, Mr. Johan', 'Elias, Mr. Dibo', 'Elias, Mr. Joseph Jr', 'Elias, Mr. Tannous', 'Elsbury, Mr. William James', 'Emanuel, Miss. Virginia Ethel', 'Emir, Mr. Farred Chehab', 'Endres, Miss. Caroline Louise', 'Eustis, Miss. Elizabeth Mussey', 'Fahlstrom, Mr. Arne Jonas', 'Farrell, Mr. James', 'Farthing, Mr. John', 'Faunthorpe, Mrs. Lizzie (Elizabeth Anne Wilkinson)', 'Fischer, Mr. Eberhard Thelander', 'Fleming, Miss. Margaret', 'Flynn, Mr. James', 'Flynn, Mr. John', 'Flynn, Mr. John Irwin ("Irving")', 'Foo, Mr. Choong', 'Ford, Miss. Doolina Margaret "Daisy"', 'Ford, Miss. Robina Maggie "Ruby"', 'Ford, Mr. William Neal', 'Ford, Mrs. Edward (Margaret Ann Watson)', 'Foreman, Mr. Benjamin Laventall', 'Fortune, Miss. Alice Elizabeth', 'Fortune, Miss. Mabel Helen', 'Fortune, Mr. Charles Alexander', 'Fortune, Mr. Mark', 'Fox, Mr. Stanley Hubert', 'Francatelli, Miss. Laura Mabel', 'Frauenthal, Dr. Henry William', 'Frauenthal, Mrs. Henry William (Clara Heinsheimer)', 'Frolicher, Miss. Hedwig Margaritha', 'Frolicher-Stehli, Mr. Maxmillian', 'Frost, Mr. Anthony Wood "Archie"', 'Fry, Mr. Richard', 'Funk, Miss. Annie Clemmer', 'Futrelle, Mr. Jacques Heath', 'Futrelle, Mrs. Jacques Heath (Lily May Peel)', 'Fynney, Mr. Joseph J', 'Gale, Mr. Shadrach', 'Gallagher, Mr. Martin', 'Garfirth, Mr. John', 'Garside, Miss. Ethel', 'Gaskell, Mr. Alfred', 'Gavey, Mr. Lawrence', 'Gee, Mr. Arthur H', 'Gheorgheff, Mr. Stanio', 'Giglio, Mr. Victor', 'Giles, Mr. Frederick Edward', 'Gilinski, Mr. Eliezer', 'Gill, Mr. John William', 'Gillespie, Mr. William Henry', 'Gilnagh, Miss. Katherine "Katie"', 'Givard, Mr. Hans Kristensen', 'Glynn, Miss. Mary Agatha', 'Goldenberg, Mr. Samuel L', 'Goldenberg, Mrs. Samuel L (Edwiga Grabowska)', 'Goldschmidt, Mr. George B', 'Goldsmith, Master. Frank John William "Frankie"', 'Goldsmith, Mr. Frank John', 'Goldsmith, Mrs. Frank John (Emily Alice Brown)', 'Goncalves, Mr. Manuel Estanslas', 'Goodwin, Master. Harold Victor', 'Goodwin, Master. Sidney Leonard', 'Goodwin, Master. William Frederick', 'Goodwin, Miss. Lillian Amy', 'Goodwin, Mr. Charles Edward', 'Goodwin, Mrs. Frederick (Augusta Tyler)', 'Graham, Miss. Margaret Edith', 'Graham, Mr. George Edward', 'Graham, Mrs. William Thompson (Edith Junkins)', 'Green, Mr. George Henry', 'Greenberg, Mr. Samuel', 'Greenfield, Mr. William Bertram', 'Gronnestad, Mr. Daniel Danielsen', 'Guggenheim, Mr. Benjamin', 'Gustafsson, Mr. Alfred Ossian', 'Gustafsson, Mr. Anders Vilhelm', 'Gustafsson, Mr. Johan Birger', 'Gustafsson, Mr. Karl Gideon', 'Haas, Miss. Aloisia', 'Hagland, Mr. Ingvald Olai Olsen', 'Hagland, Mr. Konrad Mathias Reiersen', 'Hakkarainen, Mr. Pekka Pietari', 'Hakkarainen, Mrs. Pekka Pietari (Elin Matilda Dolck)', 'Hale, Mr. Reginald', 'Hamalainen, Master. Viljo', 'Hamalainen, Mrs. William (Anna)', 'Hampe, Mr. Leon', 'Hanna, Mr. Mansour', 'Hansen, Mr. Claus Peter', 'Hansen, Mr. Henrik Juul', 'Hansen, Mr. Henry Damsgaard', 'Harder, Mr. George Achilles', 'Harknett, Miss. Alice Phoebe', 'Harmer, Mr. Abraham (David Lishin)', 'Harper, Miss. Annie Jessie "Nina"', 'Harper, Mr. Henry Sleeper', 'Harper, Mrs. Henry Sleeper (Myna Haxtun)', 'Harper, Rev. John', 'Harrington, Mr. Charles H', 'Harris, Mr. George', 'Harris, Mr. Henry Birkhardt', 'Harris, Mr. Walter', 'Harris, Mrs. Henry Birkhardt (Irene Wallach)', 'Harrison, Mr. William', 'Hart, Miss. Eva Miriam', 'Hart, Mr. Benjamin', 'Hart, Mr. Henry', 'Hart, Mrs. Benjamin (Esther Ada Bloomfield)', 'Hassab, Mr. Hammad', 'Hassan, Mr. Houssein G N', 'Hawksford, Mr. Walter James', 'Hays, Miss. Margaret Bechstein', 'Hays, Mrs. Charles Melville (Clara Jennings Gregg)', 'Healy, Miss. Hanora "Nora"', 'Hedman, Mr. Oskar Arvid', 'Hegarty, Miss. Hanora "Nora"', 'Heikkinen, Miss. Laina', 'Heininen, Miss. Wendla Maria', 'Hendekovic, Mr. Ignjac', 'Henry, Miss. Delia', 'Herman, Miss. Alice', 'Herman, Mrs. Samuel (Jane Laver)', 'Hewlett, Mrs. (Mary D Kingcome) ', 'Hickman, Mr. Leonard Mark', 'Hickman, Mr. Lewis', 'Hickman, Mr. Stanley George', 'Hippach, Miss. Jean Gertrude', 'Hippach, Mrs. Louis Albert (Ida Sophia Fischer)', 'Hirvonen, Miss. Hildur E', 'Hocking, Mr. Richard George', 'Hocking, Mrs. Elizabeth (Eliza Needs)', 'Hodges, Mr. Henry Price', 'Hogeboom, Mrs. John C (Anna Andrews)', 'Hold, Mr. Stephen', 'Holm, Mr. John Fredrik Alexander', 'Holverson, Mr. Alexander Oskar', 'Holverson, Mrs. Alexander Oskar (Mary Aline Towner)', 'Homer, Mr. Harry ("Mr E Haven")', 'Honkanen, Miss. Eliina', 'Hood, Mr. Ambrose Jr', 'Horgan, Mr. John', 'Hosono, Mr. Masabumi', 'Hoyt, Mr. Frederick Maxfield', 'Hoyt, Mr. William Fisher', 'Hoyt, Mrs. Frederick Maxfield (Jane Anne Forby)', 'Humblen, Mr. Adolf Mathias Nicolai Olsen', 'Hunt, Mr. George Henry', 'Ibrahim Shawah, Mr. Yousseff', 'Icard, Miss. Amelie', 'Ilett, Miss. Bertha', 'Ilmakangas, Miss. Pieta Sofia', 'Isham, Miss. Ann Elizabeth', 'Ivanoff, Mr. Kanio', 'Jacobsohn, Mr. Sidney Samuel', 'Jacobsohn, Mrs. Sidney Samuel (Amy Frances Christy)', 'Jalsevac, Mr. Ivan', 'Jansson, Mr. Carl Olof', 'Jardin, Mr. Jose Neto', 'Jarvis, Mr. John Denzil', 'Jenkin, Mr. Stephen Curnow', 'Jensen, Mr. Hans Peder', 'Jensen, Mr. Niels Peder', 'Jensen, Mr. Svend Lauritz', 'Jermyn, Miss. Annie', 'Jerwan, Mrs. Amin S (Marie Marthe Thuillard)', 'Johannesen-Bratthammer, Mr. Bernt', 'Johanson, Mr. Jakob Alfred', 'Johansson, Mr. Erik', 'Johansson, Mr. Gustaf Joel', 'Johansson, Mr. Karl Johan', 'Johnson, Master. Harold Theodor', 'Johnson, Miss. Eleanor Ileen', 'Johnson, Mr. Alfred', 'Johnson, Mr. Malkolm Joackim', 'Johnson, Mr. William Cahoone Jr', 'Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)', 'Johnston, Miss. Catherine Helen "Carrie"', 'Johnston, Mr. Andrew G', 'Jonkoff, Mr. Lalio', 'Jonsson, Mr. Carl', 'Jussila, Miss. Katriina', 'Jussila, Miss. Mari Aina', 'Jussila, Mr. Eiriik', 'Kallio, Mr. Nikolai Erland', 'Kalvik, Mr. Johannes Halvorsen', 'Kantor, Mr. Sinai', 'Kantor, Mrs. Sinai (Miriam Sternin)', 'Karaic, Mr. Milan', 'Karlsson, Mr. Nils August', 'Karun, Miss. Manca', 'Kassem, Mr. Fared', 'Keane, Miss. Nora A', 'Keane, Mr. Andrew "Andy"', 'Keefe, Mr. Arthur', 'Kelly, Miss. Anna Katherine "Annie Kate"', 'Kelly, Miss. Mary', 'Kelly, Mr. James', 'Kelly, Mrs. Florence "Fannie"', 'Kent, Mr. Edward Austin', 'Kenyon, Mrs. Frederick R (Marion)', 'Kiernan, Mr. Philip', 'Kilgannon, Mr. Thomas J', 'Kimball, Mr. Edwin Nelson Jr', 'Kink, Mr. Vincenz', 'Kink-Heilmann, Miss. Luise Gretchen', 'Kirkland, Rev. Charles Leonard', 'Klaber, Mr. Herman', 'Klasen, Mr. Klas Albin', 'Knight, Mr. Robert J', 'Kraeff, Mr. Theodor', 'Kvillner, Mr. Johan Henrik Johannesson', 'Lahoud, Mr. Sarkis', 'Lahtinen, Mrs. William (Anna Sylfven)', 'Laitinen, Miss. Kristina Sofia', 'Laleff, Mr. Kristo', 'Lam, Mr. Ali', 'Lam, Mr. Len', 'Landergren, Miss. Aurora Adelia', 'Lang, Mr. Fang', 'Laroche, Miss. Simonne Marie Anne Andree', 'Laroche, Mr. Joseph Philippe Lemercier', 'Laroche, Mrs. Joseph (Juliette Marie Louise Lafargue)', 'Larsson, Mr. August Viktor', 'Larsson, Mr. Bengt Edvin', 'LeRoy, Miss. Bertha', 'Leader, Dr. Alice (Farnham)', 'Leeni, Mr. Fahim ("Philip Zenni")', 'Lefebre, Master. Henry Forbes', 'Lefebre, Miss. Ida', 'Lefebre, Miss. Jeannie', 'Lefebre, Miss. Mathilde', 'Lehmann, Miss. Bertha', 'Leinonen, Mr. Antti Gustaf', 'Leitch, Miss. Jessie Wills', 'Lemberopolous, Mr. Peter L', 'Lemore, Mrs. (Amelia Milley)', 'Lennon, Mr. Denis', 'Leonard, Mr. Lionel', 'Lester, Mr. James', 'Lesurer, Mr. Gustave J', 'Levy, Mr. Rene Jacques', 'Lewy, Mr. Ervin G', 'Leyson, Mr. Robert William Norman', 'Lievens, Mr. Rene Aime', 'Lindahl, Miss. Agda Thorilda Viktoria', 'Lindblom, Miss. Augusta Charlotta', 'Lindell, Mr. Edvard Bengtsson', 'Lindqvist, Mr. Eino William', 'Lines, Miss. Mary Conover', 'Ling, Mr. Lee', 'Lobb, Mr. William Arthur', 'Lobb, Mrs. William Arthur (Cordelia K Stanlick)', 'Long, Mr. Milton Clyde', 'Longley, Miss. Gretchen Fiske', 'Louch, Mrs. Charles Alexander (Alice Adelaide Slow)', 'Lovell, Mr. John Hall ("Henry")', 'Lulic, Mr. Nikola', 'Lundahl, Mr. Johan Svensson', 'Lurette, Miss. Elise', 'Mack, Mrs. (Mary)', 'Madigan, Miss. Margaret "Maggie"', 'Madill, Miss. Georgette Alexandra', 'Madsen, Mr. Fridtjof Arne', 'Maenpaa, Mr. Matti Alexanteri', 'Maioni, Miss. Roberta', 'Maisner, Mr. Simon', 'Mallet, Master. Andre', 'Mallet, Mr. Albert', 'Mamee, Mr. Hanna', 'Mangan, Miss. Mary', 'Mannion, Miss. Margareth', 'Marechal, Mr. Pierre', 'Markoff, Mr. Marin', 'Markun, Mr. Johann', 'Marvin, Mr. Daniel Warner', 'Masselmani, Mrs. Fatima', 'Matthews, Mr. William John', 'Mayne, Mlle. Berthe Antonine ("Mrs de Villiers")', 'McCarthy, Mr. Timothy J', 'McCormack, Mr. Thomas Joseph', 'McCoy, Miss. Agnes', 'McCoy, Mr. Bernard', 'McDermott, Miss. Brigdet Delia', 'McEvoy, Mr. Michael', 'McGough, Mr. James Robert', 'McGovern, Miss. Mary', 'McGowan, Miss. Anna "Annie"', 'McKane, Mr. Peter David', 'McMahon, Mr. Martin', 'McNamee, Mr. Neal', 'Meanwell, Miss. (Marion Ogden)', 'Meek, Mrs. Thomas (Annie Louise Rowley)', 'Mellinger, Miss. Madeleine Violet', 'Mellinger, Mrs. (Elizabeth Anne Maidment)', 'Mellors, Mr. William John', 'Meo, Mr. Alfonzo', 'Mernagh, Mr. Robert', 'Meyer, Mr. August', 'Meyer, Mr. Edgar Joseph', 'Meyer, Mrs. Edgar Joseph (Leila Saks)', 'Millet, Mr. Francis Davis', 'Milling, Mr. Jacob Christian', 'Minahan, Dr. William Edward', 'Minahan, Miss. Daisy E', 'Mineff, Mr. Ivan', 'Mionoff, Mr. Stoytcho', 'Mitchell, Mr. Henry Michael', 'Mitkoff, Mr. Mito', 'Mockler, Miss. Helen Mary "Ellie"', 'Moen, Mr. Sigurd Hansen', 'Molson, Mr. Harry Markland', 'Montvila, Rev. Juozas', 'Moor, Master. Meier', 'Moor, Mrs. (Beila)', 'Moore, Mr. Leonard Charles', 'Moran, Miss. Bertha', 'Moran, Mr. Daniel J', 'Moran, Mr. James', 'Moraweck, Dr. Ernest', 'Morley, Mr. Henry Samuel ("Mr Henry Marshall")', 'Morley, Mr. William', 'Morrow, Mr. Thomas Rowan', 'Moss, Mr. Albert Johan', 'Moubarek, Master. Gerios', 'Moubarek, Master. Halim Gonios ("William George")', 'Moussa, Mrs. (Mantoura Boulos)', 'Moutal, Mr. Rahamin Haim', 'Mudd, Mr. Thomas Charles', 'Mullens, Miss. Katherine "Katie"', 'Murdlin, Mr. Joseph', 'Murphy, Miss. Katherine "Kate"', 'Murphy, Miss. Margaret Jane', 'Myhrman, Mr. Pehr Fabian Oliver Malkolm', 'Naidenoff, Mr. Penko', 'Najib, Miss. Adele Kiamie "Jane"', 'Nakid, Miss. Maria ("Mary")', 'Nakid, Mr. Sahid', 'Nankoff, Mr. Minko', 'Nasser, Mr. Nicholas', 'Nasser, Mrs. Nicholas (Adele Achem)', 'Natsch, Mr. Charles H', 'Navratil, Master. Edmond Roger', 'Navratil, Master. Michel M', 'Navratil, Mr. Michel ("Louis M Hoffman")', 'Nenkoff, Mr. Christo', 'Newell, Miss. Madeleine', 'Newell, Miss. Marjorie', 'Newell, Mr. Arthur Webster', 'Newsom, Miss. Helen Monypeny', 'Nicholls, Mr. Joseph Charles', 'Nicholson, Mr. Arthur Ernest', 'Nicola-Yarred, Master. Elias', 'Nicola-Yarred, Miss. Jamila', 'Nilsson, Miss. Helmina Josefina', 'Nirva, Mr. Iisakki Antino Aijo', 'Niskanen, Mr. Juha', 'Norman, Mr. Robert Douglas', 'Nosworthy, Mr. Richard Cater', 'Novel, Mr. Mansouer', 'Nye, Mrs. (Elizabeth Ramell)', 'Nysten, Miss. Anna Sofia', 'Nysveen, Mr. Johan Hansen', "O'Brien, Mr. Thomas", "O'Brien, Mr. Timothy", 'O\'Brien, Mrs. Thomas (Johanna "Hannah" Godfrey)', "O'Connell, Mr. Patrick D", "O'Connor, Mr. Maurice", "O'Driscoll, Miss. Bridget", 'O\'Dwyer, Miss. Ellen "Nellie"', 'O\'Leary, Miss. Hanora "Norah"', "O'Sullivan, Miss. Bridget Mary", 'Odahl, Mr. Nils Martin', 'Ohman, Miss. Velin', 'Olsen, Mr. Henry Margido', 'Olsen, Mr. Karl Siegwart Andreas', 'Olsen, Mr. Ole Martin', 'Olsson, Miss. Elina', 'Olsson, Mr. Nils Johan Goransson', 'Olsvigen, Mr. Thor Anderson', 'Oreskovic, Miss. Marija', 'Oreskovic, Mr. Luka', 'Osen, Mr. Olaf Elon', 'Osman, Mrs. Mara', 'Ostby, Mr. Engelhart Cornelius', 'Otter, Mr. Richard', 'Padro y Manent, Mr. Julian', 'Pain, Dr. Alfred', 'Palsson, Master. Gosta Leonard', 'Palsson, Miss. Stina Viola', 'Palsson, Miss. Torborg Danira', 'Palsson, Mrs. Nils (Alma Cornelia Berglund)', 'Panula, Master. Eino Viljami', 'Panula, Master. Juha Niilo', 'Panula, Master. Urho Abraham', 'Panula, Mr. Ernesti Arvid', 'Panula, Mr. Jaako Arnold', 'Panula, Mrs. Juha (Maria Emilia Ojala)', 'Parkes, Mr. Francis "Frank"', 'Parr, Mr. William Henry Marsh', 'Parrish, Mrs. (Lutie Davis)', 'Partner, Mr. Austen', 'Pasic, Mr. Jakob', 'Patchett, Mr. George', 'Paulner, Mr. Uscher', 'Pavlovic, Mr. Stefo', 'Pears, Mr. Thomas Clinton', 'Pears, Mrs. Thomas (Edith Wearne)', 'Peduzzi, Mr. Joseph', 'Pekoniemi, Mr. Edvard', 'Penasco y Castellana, Mr. Victor de Satode', 'Penasco y Castellana, Mrs. Victor de Satode (Maria Josefa Perez de Soto y Vallejo)', 'Pengelly, Mr. Frederick William', 'Perkin, Mr. John Henry', 'Pernot, Mr. Rene', 'Pe

In [28]:
import numpy as np

In [29]:
char_cabin=df['Cabin'].astype(str)
new_cabin=[i[0] for i in char_cabin]
df['cabin_1']=new_cabin

In [31]:
char_cabin

0       nan
1       C85
2       nan
3      C123
4       nan
       ...
886     nan
887     B42
888     nan
889    C148
890     nan
Name: Cabin, Length: 891, dtype: object

In [33]:
df['Age'].isnull().sum()

177

In [34]:
df.shape

(891, 13)

In [35]:
np.where(df['Age'].isnull()==True)

(array([  5,  17,  19,  26,  28,  29,  31,  32,  36,  42,  45,  46,  47,
         48,  55,  64,  65,  76,  77,  82,  87,  95, 101, 107, 109, 121,
        126, 128, 140, 154, 158, 159, 166, 168, 176, 180, 181, 185, 186,
        196, 198, 201, 214, 223, 229, 235, 240, 241, 250, 256, 260, 264,
        270, 274, 277, 284, 295, 298, 300, 301, 303, 304, 306, 324, 330,
        334, 335, 347, 351, 354, 358, 359, 364, 367, 368, 375, 384, 388,
        409, 410, 411, 413, 415, 420, 425, 428, 431, 444, 451, 454, 457,
        459, 464, 466, 468, 470, 475, 481, 485, 490, 495, 497, 502, 507,
        511, 517, 522, 524, 527, 531, 533, 538, 547, 552, 557, 560, 563,
        564, 568, 573, 578, 584, 589, 593, 596, 598, 601, 602, 611, 612,
        613, 629, 633, 639, 643, 648, 650, 653, 656, 667, 669, 674, 680,
        692, 697, 709, 711, 718, 727, 732, 738, 739, 740, 760, 766, 768,
        773, 776, 778, 783, 790, 792, 793, 815, 825, 826, 828, 832, 837,
        839, 846, 849, 859, 863, 868, 878, 888], dtype=int64),)

In [36]:
max(df['Fare'])

512.3292

In [37]:
np.where(df['Fare']==max(df['Fare']))

(array([258, 679, 737], dtype=int64),)

In [40]:
df.iloc[[258,679,737]]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,cabin_1
258,259,1,1,"Ward, Miss. Anna",female,35.0,0,0,PC 17755,512.3292,NaN,C,n
679,680,1,1,"Cardeza, Mr. Thomas Drake Martinez",male,36.0,0,1,PC 17755,512.3292,B51 B53 B55,C,B
737,738,1,1,"Lesurer, Mr. Gustave J",male,35.0,0,0,PC 17755,512.3292,B101,C,B

In [42]:
np.where(df["Age"]==min(df['Age']))

(array([803], dtype=int64),)

In [44]:
df.iloc[(np.where(df['Age']==min(df['Age'])))]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,cabin_1
803,804,1,3,"Thomas, Master. Assad Alexander",male,0.42,0,1,2625,8.5167,NaN,C,n

In [45]:
df.iloc[(np.where(df['Age']==min(df['Age'])))][['Name','Age','Cabin']]

                                Name   Age Cabin
803  Thomas, Master. Assad Alexander  0.42   NaN

In [46]:
df['Family']=df['SibSp']+df['Parch']

In [47]:
df['Family']

0      1
1      1
2      0
3      1
4      0
      ..
886    0
887    0
888    3
889    0
890    0
Name: Family, Length: 891, dtype: int64

In [48]:
most_fam=np.where(df['Family']==max(df['Family']))

In [49]:
df.iloc[most_fam]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,cabin_1,Family
159,160,0,3,"Sage, Master. Thomas Henry",male,NaN,8,2,CA. 2343,69.55,NaN,S,n,10
180,181,0,3,"Sage, Miss. Constance Gladys",female,NaN,8,2,CA. 2343,69.55,NaN,S,n,10
201,202,0,3,"Sage, Mr. Frederick",male,NaN,8,2,CA. 2343,69.55,NaN,S,n,10
324,325,0,3,"Sage, Mr. George John Jr",male,NaN,8,2,CA. 2343,69.55,NaN,S,n,10
792,793,0,3,"Sage, Miss. Stella Anna",female,NaN,8,2,CA. 2343,69.55,NaN,S,n,10
846,847,0,3,"Sage, Mr. Douglas Bullen",male,NaN,8,2,CA. 2343,69.55,NaN,S,n,10
863,864,0,3,"Sage, Miss. Dorothy Edith ""Dolly""",female,NaN,8,2,CA. 2343,69.55,NaN,S,n,10

In [57]:
from numpy.random import randn as rn
matrix_data=rn(5,4)
col_index=['A','B','C','D']

df=pd.DataFrame(matrix_data,columns=col_index)

In [58]:
df

          A         B         C         D
0  2.548913  0.249747 -0.391242 -0.248220
1 -0.074258 -1.821122 -1.070147  1.463655
2  1.192349  2.553071 -0.422432  0.255911
3 -0.758924 -1.134625  0.717787  1.281523
4  0.251076 -1.601992  0.795048 -0.528331

In [61]:
df.iloc[0]

A    2.548913
B    0.249747
C   -0.391242
D   -0.248220
Name: 0, dtype: float64

In [62]:
df.iloc[[4,1,2],[1]]

          B
4 -1.601992
1 -1.821122
2  2.553071

In [69]:
df.loc[[1,2],['B','C']]

          B         C
1 -1.821122 -1.070147
2  2.553071 -0.422432

In [71]:
df.iloc[[0,4],[0,3]]

          A         D
0  2.548913 -0.248220
4  0.251076 -0.528331

In [85]:
df.iloc[1:5,0:3]

          A         B         C
1 -0.074258 -1.821122 -1.070147
2  1.192349  2.553071 -0.422432
3 -0.758924 -1.134625  0.717787
4  0.251076 -1.601992  0.795048

In [86]:
df.drop('A',axis=1)

          B         C         D
0  0.249747 -0.391242 -0.248220
1 -1.821122 -1.070147  1.463655
2  2.553071 -0.422432  0.255911
3 -1.134625  0.717787  1.281523
4 -1.601992  0.795048 -0.528331

In [87]:
df

          A         B         C         D
0  2.548913  0.249747 -0.391242 -0.248220
1 -0.074258 -1.821122 -1.070147  1.463655
2  1.192349  2.553071 -0.422432  0.255911
3 -0.758924 -1.134625  0.717787  1.281523
4  0.251076 -1.601992  0.795048 -0.528331

In [88]:
df.drop('A',inplace=True,axis=1)

In [89]:
df

          B         C         D
0  0.249747 -0.391242 -0.248220
1 -1.821122 -1.070147  1.463655
2  2.553071 -0.422432  0.255911
3 -1.134625  0.717787  1.281523
4 -1.601992  0.795048 -0.528331

In [91]:
df.drop(0)

          B         C         D
1 -1.821122 -1.070147  1.463655
2  2.553071 -0.422432  0.255911
3 -1.134625  0.717787  1.281523
4 -1.601992  0.795048 -0.528331

In [92]:
df

          B         C         D
0  0.249747 -0.391242 -0.248220
1 -1.821122 -1.070147  1.463655
2  2.553071 -0.422432  0.255911
3 -1.134625  0.717787  1.281523
4 -1.601992  0.795048 -0.528331

In [95]:
df.ix[[0]]

AttributeError: 'DataFrame' object has no attribute 'ix'

In [96]:
!pip install ix

Collecting ix
  Downloading ix-0.0.2-py3-none-any.whl (42 kB)
Installing collected packages: ix
Successfully installed ix-0.0.2

In [98]:
df.ix[[0]]

AttributeError: 'DataFrame' object has no attribute 'ix'

In [102]:
print('\nConditional problem\n','-'*30,sep=' ')
print(df>0)

Conditional problem
 ------------------------------
       B      C      D
0   True  False  False
1  False  False   True
2   True  False   True
3  False   True   True
4  False   True  False

In [108]:
#Matrix to DataFrame
import numpy as np
matrix_data=np.matrix('22,66,140;42,70,148;30,62,125;35,68,160;25,62,152')

matrix_data

matrix([[ 22,  66, 140],
        [ 42,  70, 148],
        [ 30,  62, 125],
        [ 35,  68, 160],
        [ 25,  62, 152]])

In [109]:
row_labels=['A','B','C','D','E']
column=['Age','Height','Weight']

In [110]:
dff=pd.DataFrame(matrix_data,row_labels,column)

In [111]:
dff

   Age  Height  Weight
A   22      66     140
B   42      70     148
C   30      62     125
D   35      68     160
E   25      62     152

In [116]:
dff[dff['Height']<65]

   Age  Height  Weight
C   30      62     125
E   25      62     152

In [126]:
dff[(dff['Age']>25) & (dff['Height']<65)]

   Age  Height  Weight
C   30      62     125

In [15]:
outside=['G1','G1','G1','G2','G2','G2']
inside=[1,2,3,1,2,3]
hier_index=list(zip(outside,inside))
hier_index

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [16]:
hier_index=pd.MultiIndex.from_tuples(hier_index)
print(hier_index)

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [17]:
import pandas as pd
from numpy.random import randn as rn

In [18]:
df3=pd.DataFrame(data=np.round(rn(6,3)),index=hier_index,columns=['A','B','C'])
print(df3)

        A    B    C
G1 1  1.0 -1.0 -1.0
   2 -0.0  1.0  0.0
   3  1.0  0.0 -1.0
G2 1  1.0  1.0  2.0
   2 -1.0 -0.0  2.0
   3 -2.0 -0.0 -1.0

In [38]:
df3.loc['G1'].loc[3,['B','C']]

B    0.0
C   -1.0
Name: 3, dtype: float64

In [40]:
l1=['A','A','A','B','B','B','C','C','C']
l2=[1,2,3,1,2,3,1,2,3]
l3=[1,2,3,4,5,6,7,8,9]

hier_index1=list(zip(l1,l2,l3))

In [42]:
hier_index1

[('A', 1, 1),
 ('A', 2, 2),
 ('A', 3, 3),
 ('B', 1, 4),
 ('B', 2, 5),
 ('B', 3, 6),
 ('C', 1, 7),
 ('C', 2, 8),
 ('C', 3, 9)]

In [43]:
g=pd.MultiIndex.from_tuples(hier_index1)
df5=pd.DataFrame(data=np.round(rn(9,4)),index=g)

In [44]:
df5

         0    1    2    3
A 1 1 -3.0 -0.0  0.0 -0.0
  2 2  1.0 -1.0 -1.0  0.0
  3 3 -1.0  1.0 -1.0  1.0
B 1 4  0.0  0.0  0.0 -0.0
  2 5  1.0  1.0  1.0  0.0
  3 6 -2.0 -1.0 -1.0 -0.0
C 1 7  1.0 -1.0  0.0  2.0
  2 8  0.0 -1.0  1.0  0.0
  3 9  1.0  0.0  2.0  0.0